{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3/assignment3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Jun 2020, 21:47:19

{com}. {txt}*(1 variable, 77 observations pasted into data editor)
{com}
. drop var1

. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. {txt}*(1 variable, 11 observations pasted into data editor)
{com}
. ren var1 patient
{res}
{com}. ren var2 y1
{res}
{com}. ren var3 y0
{res}
{com}. ren var4 age
{res}
{com}. ren var5 treatment_effect
{res}
{com}. ren var6 d
{res}
{com}. ren var7 outcome
{res}
{com}. label var patient "Patient"

. label var y1 "Y1"

. label var y0 "Y0"

. label var age "Age"

. label var treatment_effect "TE"

. label var d "Treatment"

. label var outcome "Outcome"

. reg outcome d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.36
{txt}       Model {c |} {res} 1.87012987         1  1.87012987   {txt}Prob > F        ={res}    0.5637
{txt}    Residual {c |} {res} 46.8571429         9  5.20634921   {txt}R-squared       ={res}    0.0384
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0685
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.2817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .8571429{col 26}{space 2} 1.430158{col 37}{space 1}    0.60{col 46}{space 3}0.564{col 54}{space 4}-2.378099{col 67}{space 3} 4.092385
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.142857{col 26}{space 2} .8624176{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 5.191933{col 67}{space 3} 9.093781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. predict
{err}'' found where varname expected
{txt}{search r(7):r(7);}

{com}. reg d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}    13.00
{txt}       Model {c |} {res} 1.50432067         1  1.50432067   {txt}Prob > F        ={res}    0.0057
{txt}    Residual {c |} {res} 1.04113388         9  .115681542   {txt}R-squared       ={res}    0.5910
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5455
{txt}       Total {c |} {res} 2.54545455        10  .254545455   {txt}Root MSE        =   {res} .34012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0141553{col 26}{space 2} .0039254{col 37}{space 1}    3.61{col 46}{space 3}0.006{col 54}{space 4} .0052755{col 67}{space 3} .0230351
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4033227{col 26}{space 2} .2361161{col 37}{space 1}   -1.71{col 46}{space 3}0.122{col 54}{space 4}-.9374544{col 67}{space 3} .1308091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. predict u1
{txt}(option {bf:xb} assumed; fitted values)

{com}. h predict

. gen x2 = d-u1

. br

. reg outcome x2

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.00
{txt}       Model {c |} {res} .000209609         1  .000209609   {txt}Prob > F        ={res}    0.9952
{txt}    Residual {c |} {res} 48.7270631         9  5.41411812   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1111
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}x2 {c |}{col 14}{res}{space 2}  .014189{col 26}{space 2} 2.280398{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.144429{col 67}{space 3} 5.172807
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.454545{col 26}{space 2} .7015644{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4} 5.867497{col 67}{space 3} 9.041594
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. drop u1 x2

. reg d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}    13.00
{txt}       Model {c |} {res} 1.50432067         1  1.50432067   {txt}Prob > F        ={res}    0.0057
{txt}    Residual {c |} {res} 1.04113388         9  .115681542   {txt}R-squared       ={res}    0.5910
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5455
{txt}       Total {c |} {res} 2.54545455        10  .254545455   {txt}Root MSE        =   {res} .34012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0141553{col 26}{space 2} .0039254{col 37}{space 1}    3.61{col 46}{space 3}0.006{col 54}{space 4} .0052755{col 67}{space 3} .0230351
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4033227{col 26}{space 2} .2361161{col 37}{space 1}   -1.71{col 46}{space 3}0.122{col 54}{space 4}-.9374544{col 67}{space 3} .1308091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. predict resid, residuals

. reg outcome resid

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.00
{txt}       Model {c |} {res} .000209615         1  .000209615   {txt}Prob > F        ={res}    0.9952
{txt}    Residual {c |} {res} 48.7270631         9  5.41411812   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1111
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}resid {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.280398{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.144428{col 67}{space 3} 5.172807
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.454545{col 26}{space 2} .7015644{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4} 5.867497{col 67}{space 3} 9.041594
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}    13.00
{txt}       Model {c |} {res} 1.50432067         1  1.50432067   {txt}Prob > F        ={res}    0.0057
{txt}    Residual {c |} {res} 1.04113388         9  .115681542   {txt}R-squared       ={res}    0.5910
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5455
{txt}       Total {c |} {res} 2.54545455        10  .254545455   {txt}Root MSE        =   {res} .34012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0141553{col 26}{space 2} .0039254{col 37}{space 1}    3.61{col 46}{space 3}0.006{col 54}{space 4} .0052755{col 67}{space 3} .0230351
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4033227{col 26}{space 2} .2361161{col 37}{space 1}   -1.71{col 46}{space 3}0.122{col 54}{space 4}-.9374544{col 67}{space 3} .1308091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. h reganar

. h reganat

. ssc install reganat
{txt}checking {hilite:reganat} consistency and verifying not already installed...
installing into /Users/danielcabarcas/Library/Application Support/Stata/ado/plus/...
installation complete.

{com}. h reganat

. reganat outcome d age
Dependent variable: outcome
Independent variables: d age
Plotting: d age
{res}
{com}. reganat outcome d age, dis(d age)
Dependent variable: outcome
Independent variables: d age
Plotting: d age
{res}
{com}. h outreg

. h outreg2

. reg outcome d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.36
{txt}       Model {c |} {res} 1.87012987         1  1.87012987   {txt}Prob > F        ={res}    0.5637
{txt}    Residual {c |} {res} 46.8571429         9  5.20634921   {txt}R-squared       ={res}    0.0384
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0685
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.2817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .8571429{col 26}{space 2} 1.430158{col 37}{space 1}    0.60{col 46}{space 3}0.564{col 54}{space 4}-2.378099{col 67}{space 3} 4.092385
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.142857{col 26}{space 2} .8624176{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 5.191933{col 67}{space 3} 9.093781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. //result equals SDO
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199):r(199);}

{com}. outreg2 using assignment1_table3.doc, replace ctitle("Model 1")
{txt}{stata `"shellout using `"assignment1_table3.doc"'"':assignment1_table3.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment1_table3.txt""':seeout}

{com}. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg22 using assignment2_table3.doc, append ctitle ("Model 2")
{err}command {bf}outreg22{sf} is unrecognized
{txt}{search r(199):r(199);}

{com}. outreg2 using assignment2_table3.doc, append ctitle ("Model 2")
{txt}{stata `"shellout using `"assignment2_table3.doc"'"':assignment2_table3.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment2_table3.txt""':seeout}

{com}. reg outcome d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.36
{txt}       Model {c |} {res} 1.87012987         1  1.87012987   {txt}Prob > F        ={res}    0.5637
{txt}    Residual {c |} {res} 46.8571429         9  5.20634921   {txt}R-squared       ={res}    0.0384
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0685
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.2817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .8571429{col 26}{space 2} 1.430158{col 37}{space 1}    0.60{col 46}{space 3}0.564{col 54}{space 4}-2.378099{col 67}{space 3} 4.092385
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.142857{col 26}{space 2} .8624176{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 5.191933{col 67}{space 3} 9.093781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. //result equals SDO
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199):r(199);}

{com}. outreg2 using assignment1_table3.doc, replace ctitle("Model 1")
{txt}{stata `"shellout using `"assignment1_table3.doc"'"':assignment1_table3.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment1_table3.txt""':seeout}

{com}. 
. *b

. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg2 using assignment1_table3.doc, append ctitle ("Model 2")
{txt}{stata `"shellout using `"assignment1_table3.doc"'"':assignment1_table3.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment1_table3.txt""':seeout}

{com}. reg outcome d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.36
{txt}       Model {c |} {res} 1.87012987         1  1.87012987   {txt}Prob > F        ={res}    0.5637
{txt}    Residual {c |} {res} 46.8571429         9  5.20634921   {txt}R-squared       ={res}    0.0384
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0685
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.2817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .8571429{col 26}{space 2} 1.430158{col 37}{space 1}    0.60{col 46}{space 3}0.564{col 54}{space 4}-2.378099{col 67}{space 3} 4.092385
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.142857{col 26}{space 2} .8624176{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 5.191933{col 67}{space 3} 9.093781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. //result equals SDO
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199):r(199);}

{com}. outreg2 using assignment1_table1.doc, replace ctitle("Model 1")
{txt}{stata `"shellout using `"assignment1_table1.doc"'"':assignment1_table1.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment1_table1.txt""':seeout}

{com}. 
. *b

. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg2 using assignment1_table1.doc, append ctitle ("Model 2")
{txt}{stata `"shellout using `"assignment1_table1.doc"'"':assignment1_table1.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment1_table1.txt""':seeout}

{com}. reg outcome d

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.36
{txt}       Model {c |} {res} 1.87012987         1  1.87012987   {txt}Prob > F        ={res}    0.5637
{txt}    Residual {c |} {res} 46.8571429         9  5.20634921   {txt}R-squared       ={res}    0.0384
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.0685
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.2817

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .8571429{col 26}{space 2} 1.430158{col 37}{space 1}    0.60{col 46}{space 3}0.564{col 54}{space 4}-2.378099{col 67}{space 3} 4.092385
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.142857{col 26}{space 2} .8624176{col 37}{space 1}    8.28{col 46}{space 3}0.000{col 54}{space 4} 5.191933{col 67}{space 3} 9.093781
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. //result equals SDO
{bf}{err}/{sf} is not a valid command name
{txt}{search r(199):r(199);}

{com}. outreg2 using assignment3_table1.doc, replace ctitle("Model 1") label
{txt}{stata `"shellout using `"assignment3_table1.doc"'"':assignment3_table1.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment3_table1.txt", label"':seeout}

{com}. 
. *b

. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg2 using assignment3_table1.doc, append ctitle ("Model 2") label
{txt}{stata `"shellout using `"assignment3_table1.doc"'"':assignment3_table1.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment3_table1.txt", label"':seeout}

{com}. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg2 using assignment3_table2.doc, replace ctitle("Model 1") label
{txt}{stata `"shellout using `"assignment3_table2.doc"'"':assignment3_table2.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment3_table2.txt", label"':seeout}

{com}. 
. reg d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}    13.00
{txt}       Model {c |} {res} 1.50432067         1  1.50432067   {txt}Prob > F        ={res}    0.0057
{txt}    Residual {c |} {res} 1.04113388         9  .115681542   {txt}R-squared       ={res}    0.5910
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5455
{txt}       Total {c |} {res} 2.54545455        10  .254545455   {txt}Root MSE        =   {res} .34012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0141553{col 26}{space 2} .0039254{col 37}{space 1}    3.61{col 46}{space 3}0.006{col 54}{space 4} .0052755{col 67}{space 3} .0230351
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4033227{col 26}{space 2} .2361161{col 37}{space 1}   -1.71{col 46}{space 3}0.122{col 54}{space 4}-.9374544{col 67}{space 3} .1308091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg2 using assignment3_table2.doc, append ctitle("Model 2") label
{txt}{stata `"shellout using `"assignment3_table2.doc"'"':assignment3_table2.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment3_table2.txt", label"':seeout}

{com}. 
. predict resid, residuals
{err}variable {bf}resid{sf} already defined
{txt}{search r(110):r(110);}

{com}. label var resid "D*"

. 
. reg outcome resid

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.00
{txt}       Model {c |} {res} .000209615         1  .000209615   {txt}Prob > F        ={res}    0.9952
{txt}    Residual {c |} {res} 48.7270631         9  5.41411812   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1111
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}resid {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.280398{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.144428{col 67}{space 3} 5.172807
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.454545{col 26}{space 2} .7015644{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4} 5.867497{col 67}{space 3} 9.041594
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. outreg2 using assignment3_table2.doc, append ctitle("Model 3") label
{txt}{stata `"shellout using `"assignment3_table2.doc"'"':assignment3_table2.doc}
{browse `"/Users/danielcabarcas/Documents/GitHub/causal-inference-course/Assignment 3"' :dir}{com} : {txt}{stata `"seeout using "assignment3_table2.txt", label"':seeout}

{com}. drop resid

. reg outcome d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(2, 8)         = {res}     0.27
{txt}       Model {c |} {res} 3.12194132         2  1.56097066   {txt}Prob > F        ={res}    0.7673
{txt}    Residual {c |} {res} 45.6053314         8  5.70066643   {txt}R-squared       ={res}    0.0641
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1699
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3876

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}d {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.339966{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.381782{col 67}{space 3}  5.41016
{txt}{space 9}age {c |}{col 14}{res}{space 2} .0201905{col 26}{space 2} .0430864{col 37}{space 1}    0.47{col 46}{space 3}0.652{col 54}{space 4} -.079167{col 67}{space 3}  .119548
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.355427{col 26}{space 2} 1.907361{col 37}{space 1}    3.33{col 46}{space 3}0.010{col 54}{space 4} 1.957044{col 67}{space 3} 10.75381
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg d age

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}    13.00
{txt}       Model {c |} {res} 1.50432067         1  1.50432067   {txt}Prob > F        ={res}    0.0057
{txt}    Residual {c |} {res} 1.04113388         9  .115681542   {txt}R-squared       ={res}    0.5910
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.5455
{txt}       Total {c |} {res} 2.54545455        10  .254545455   {txt}Root MSE        =   {res} .34012

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} .0141553{col 26}{space 2} .0039254{col 37}{space 1}    3.61{col 46}{space 3}0.006{col 54}{space 4} .0052755{col 67}{space 3} .0230351
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.4033227{col 26}{space 2} .2361161{col 37}{space 1}   -1.71{col 46}{space 3}0.122{col 54}{space 4}-.9374544{col 67}{space 3} .1308091
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. reg outcome resid
{err}variable {bf}resid{sf} not found
{txt}{search r(111):r(111);}

{com}. predict resid, residuals

. label var resid "D*"

. reg outcome resid

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}        11
{txt}{hline 13}{c +}{hline 34}   F(1, 9)         = {res}     0.00
{txt}       Model {c |} {res} .000209615         1  .000209615   {txt}Prob > F        ={res}    0.9952
{txt}    Residual {c |} {res} 48.7270631         9  5.41411812   {txt}R-squared       ={res}    0.0000
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}   -0.1111
{txt}       Total {c |} {res} 48.7272727        10  4.87272727   {txt}Root MSE        =   {res} 2.3268

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     outcome{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}resid {c |}{col 14}{res}{space 2} .0141892{col 26}{space 2} 2.280398{col 37}{space 1}    0.01{col 46}{space 3}0.995{col 54}{space 4}-5.144428{col 67}{space 3} 5.172807
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 7.454545{col 26}{space 2} .7015644{col 37}{space 1}   10.63{col 46}{space 3}0.000{col 54}{space 4} 5.867497{col 67}{space 3} 9.041594
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. 